uhnp/src/Catalogs/ИнвестиционныеПрограммы/ИнвестиционныеПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнвестиционныеПрограммы</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончание</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаОтображения</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоказателей</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>РазделИнвестиционнойПрограммы</name>
      <type>
        <types>CatalogRef.РазделыИнвестиционныхПрограмм</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговыйБалл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоСписанияБДДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоПоступленияБДДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоДоходыБДР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоРасходыБДР</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СостоянияПроектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/InformationRegisters/АтрибутыПроектов/АтрибутыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АтрибутыПроектов</name>
  <resources>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>NPV</name>
    <comment>Чистая приведенная стоимость денежных потоков</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>IRR</name>
    <comment>Внутренняя ставка доходности</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОценкаПроекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИтогоСписанияБДДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИтогоРасходыБДР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИтогоСписанияРесурсы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентЗавершения</name>
    <comment>Заполняется экспертом на основании его субъективной оценки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>PBP</name>
    <comment>Срок окупаемости проекта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FCF</name>
    <comment>Свободный денежный поток</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>PI</name>
    <comment>Индекс прибыльности</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИтогоПоступленияБДДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИтогоДоходыБДР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИтогоПоступленияРесурсы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИтогоЧистыйДенежныйПоток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИтогоПрибыльУбыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИтогоМатериальныйБаланс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаДисконтирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/РегистрСостоянийОбъектов/РегистрСостоянийОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрСостоянийОбъектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеОбъекта</name>
    <type>
      <types>EnumRef.СостоянияИнцидентов</types>
      <types>EnumRef.СостоянияСогласования</types>
      <types>EnumRef.СтатусыВыгружаемыхОбъектовЕИС</types>
      <types>EnumRef.СостоянияДоговоров</types>
      <types>EnumRef.СостоянияТранзакций</types>
      <types>EnumRef.СостоянияМероприятий</types>
      <types>EnumRef.СостоянияПроектов</types>
      <types>CatalogRef.СостоянияСогласования</types>
      <types>EnumRef.СостоянияОтчетов</types>
      <types>EnumRef.СтатусыЛотов</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ОбъектыДляСогласования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/СостояниеОценкиОбъектов/СостояниеОценкиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеОценкиОбъектов</name>
  <resources>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>DefinedType.ВладельцыОбъектовВыбора</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапОценки</name>
    <type>
      <types>CatalogRef.ЭтапыОценки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектОценки</name>
    <type>
      <types>DefinedType.ОбъектыВыбора</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)(-УХМодульМенеджера)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>ДевятьМесяцев</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПорядкиОкругленияОтчетности/ПорядкиОкругленияОтчетности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядкиОкругленияОтчетности</name>
  <comment>Порядки округления отчетности</comment>
  <enumValues>
    <name>Окр1</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Окр1000</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Окр1000000</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Возвращена</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНаОплате</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОплачено</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНеактивен</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/СостоянияПроектов/СостоянияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияПроектов</name>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>Возвращен</name>
  </enumValues>
  <enumValues>
    <name>ВключенВПрограмму</name>
  </enumValues>
  <enumValues>
    <name>Начат</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/Периоды/Периоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Периоды</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Произвольный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ИнвестиционныеПрограммы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	#Область УниверсальныеПроцессыСогласование
	ДействияСогласованиеУХСервер.НарисоватьПанельСогласованияИОпределитьСостояниеОбъекта(ЭтаФорма);
	#КонецОбласти
	
	Если Не ЗначениеЗаполнено(Объект.Периодичность) Тогда
		 Объект.Периодичность = Перечисления.Периодичность.Год;
	КонецЕсли;	
	
	ПрочитатьТЧПроекты(Истина);
	
	УстановитьВидимостьДоступностьЭлементов();
	
	Если Не ЗначениеЗаполнено(Объект.ЕдиницаОтображения) Тогда
		Объект.ЕдиницаОтображения = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
	КонецЕсли;	
	
	ВалютаПоказателей = Константы.ВалютаРасчетаПоказателейПроекта.Получить();
	
	ОбновитьОтображениеПоказателей();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбъектСогласован" Тогда
		#Область УниверсальныеПроцессыСогласование
		ОпределитьСостояниеОбъекта();
		#КонецОбласти	
	ИначеЕсли ИмяСобытия = "ОбъектОтклонен" Тогда
		#Область УниверсальныеПроцессыСогласование
		ОпределитьСостояниеОбъекта();
		#КонецОбласти	
	ИначеЕсли ИмяСобытия = "МаршрутИнициализирован" Тогда
		#Область УниверсальныеПроцессыСогласование
		ОпределитьСостояниеОбъекта();
		#КонецОбласти		
	ИначеЕсли ИмяСобытия = "СостояниеЗаявкиПриИзменении" Тогда
		#Область УниверсальныеПроцессыСогласование
		ОпределитьСостояниеОбъекта();
		#КонецОбласти		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПередЗаписьюНаСервере();

КонецПроцедуры

 &НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступностьЭлементов()
	
	ТекущийСтатусПрограммы = УправлениеПроцессамиСогласованияУХ.ВернутьСтатусОбъекта(Объект.Ссылка); 
	
	Элементы.ГруппаОсновнаяИнформация.ТолькоПросмотр 	= ТекущийСтатусПрограммы =Перечисления.СостоянияСогласования.Утверждена;
	Элементы.ГруппаПроекты.ТолькоПросмотр  			= ТекущийСтатусПрограммы =Перечисления.СостоянияСогласования.Утверждена;
	Элементы.ФормаЗаписатьИЗакрыть.Доступность 		= НЕ ТекущийСтатусПрограммы =Перечисления.СостоянияСогласования.Утверждена;
	Элементы.ФормаЗаписать.Доступность			 	= НЕ ТекущийСтатусПрограммы =Перечисления.СостоянияСогласования.Утверждена;
	Элементы.ИзменитьПериод.Доступность             = НЕ ТекущийСтатусПрограммы =Перечисления.СостоянияСогласования.Утверждена;
	Элементы.ГруппаКоманднаяПанельПроекты.Доступность = НЕ ТекущийСтатусПрограммы =Перечисления.СостоянияСогласования.Утверждена;

КонецПроцедуры	

&НаСервере
Процедура ПередЗаписьюНаСервере()
	
	Объект.Проекты.Очистить();
	
	//Запишем таблицу текущих проектов в табличную часть
	Для Каждого СтрПроект Из Проекты Цикл
		
		нСтрокаТЧПроект = Объект.Проекты.Добавить();
		ЗаполнитьЗначенияСвойств(нСтрокаТЧПроект,СтрПроект);
				
	КонецЦикла;	 
		
КонецПроцедуры


	
#Область ОбработчикиРаботыСПериодами

&НаКлиенте
Процедура ИзменитьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("СтандартныйПериод") Тогда
		
		ВыбраннаяПериодичность = Объект.Периодичность;
		
		РезультатДатаНачала 		= РезультатВыбора.ДатаНачала;
		РезультатДатаОкончания 		= РезультатВыбора.ДатаОкончания;
		
		Если (ЗначениеЗаполнено(РезультатДатаНачала)) И (ЗначениеЗаполнено(РезультатДатаОкончания)) Тогда
			
			ПериодыУХПовтИсп.ПроверитьИнтервалПериодов(РезультатДатаНачала, РезультатДатаОкончания, ВыбраннаяПериодичность);
			
			Объект.Период		 		= ОбщегоНазначенияУХ.ПолучитьПериодПоДате(РезультатДатаНачала, ВыбраннаяПериодичность);
			Объект.ПериодОкончание	 	= ОбщегоНазначенияУХ.ПолучитьПериодПоДате(РезультатДатаОкончания, ВыбраннаяПериодичность);
									
		Иначе
			// Не изменяем периоды.
		КонецЕсли;
	ИначеЕсли РезультатВыбора = Неопределено Тогда	
		// Пользователь отказался. Не изменяем периоды.
	Иначе
		ТекстСообщения = НСтр("ru = 'Неизвестный вариант периода ""%Период%"". Операция отменена.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Период%", Строка(РезультатВыбора));
		ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПериод(Команда)
	
	ПустаяДата = Дата(1, 1, 1);
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Если ЗначениеЗаполнено(Объект.Период) Тогда
		Диалог.Период.ДатаНачала	 = ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(Объект.Период, "ДатаНачала");
	Иначе
		Диалог.Период.ДатаНачала	 = ПустаяДата;
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ПериодОкончание) Тогда
		Диалог.Период.ДатаОкончания	 = ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(Объект.ПериодОкончание, "ДатаОкончания");
	Иначе
		Диалог.Период.ДатаНачала	 = ПустаяДата;
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьПериодЗавершение", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
		
	ПериодичностьПриИзмененииСервер();

КонецПроцедуры

&НаСервере
Процедура ПериодичностьПриИзмененииСервер() 
	
	 Если ЗначениеЗаполнено(Объект.Периодичность) Тогда
		 Если ЗначениеЗаполнено(Объект.Период) И НЕ Объект.Период.Периодичность = Объект.Периодичность Тогда
			 Объект.Период      		= ПредопределенноеЗначение("Справочник.Периоды.ПустаяСсылка");
			 Объект.ПериодОкончание   	= ПредопределенноеЗначение("Справочник.Периоды.ПустаяСсылка");
		 КонецЕсли;	 	 
	 КонецЕсли;
	 	 			
КонецПроцедуры	

&НаСервере
Процедура РассчитатьТекущийГоризонт(ПериодПланированияОтборНачало,ПериодПланированияОтборОкончание) 
	
	Объект.Период  					= ПериодПланированияОтборНачало;
	Объект.ПериодОкончание     		= ПериодПланированияОтборОкончание;
		
КонецПроцедуры	


#КонецОбласти 

#Область УниверсальныеПроцессыСогласование

&НаКлиенте
Процедура ПринятьКСогласованию_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ПринятьКСогласованию(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ИсторияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ИсторияСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура СогласоватьДокумент_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.СогласоватьДокумент(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьСогласование_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ОтменитьСогласование(ЭтаФорма);
    УстановитьВидимостьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура МаршрутСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.МаршрутСогласования(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВложенияСогласования_Подключаемый() Экспорт
	ДействияСогласованиеУХКлиент.ТелеграмВложенныеФайлы(ЭтаФорма, Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЭлементаОрганизации_Подключаемый(Элемент) Экспорт
	ОпределитьСостояниеОбъекта(Истина);		
	ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации(Элемент);
КонецПроцедуры		// ПриИзмененииЭлементаОрганизации_Подключаемый()

// Возвращает значение реквизита СостояниеЗаявки на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСостояниеЗаявки(ФормаВход)
	Возврат ФормаВход["СостояниеЗаявки"];
КонецФункции

// Возвращает значение реквизита СтатусОбъекта на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСтатусОбъекта(ФормаВход)
	Возврат ФормаВход["СтатусОбъекта"];
КонецФункции

// Возвращает значение реквизита Согласующий на форме ФормаВход.
// Т.к. данный реквизит генерируется кодом, обращение к нему напрямую из
// кода недоступно.
&НаКлиентеНаСервереБезКонтекста
Функция РеквизитСогласующий(ФормаВход)
	Возврат ФормаВход["Согласующий"];
КонецФункции

// Выполняет обработчик ПриИзменении, сопоставленный по умолчанию для элемента Элемент
&НаКлиенте
Процедура ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации(Элемент)
	#Если НЕ ВебКлиент Тогда
	ИмяЭлемента = Элемент.Имя;
	Если ЗначениеЗаполнено(ИмяЭлемента) Тогда
		Для Каждого ТекОбработчикиИзмененияОрганизации Из ЭтаФорма["ОбработчикиИзмененияОрганизации"] Цикл
			Если СокрЛП(ТекОбработчикиИзмененияОрганизации.ИмяРеквизита) = СокрЛП(ИмяЭлемента) Тогда
				СтрокаВыполнения = ТекОбработчикиИзмененияОрганизации.ИмяОбработчика + "(Элемент);";
				Выполнить СтрокаВыполнения;
			Иначе
				// Выполняем поиск далее.
			КонецЕсли; 
		КонецЦикла;	
	Иначе
		// Передан пустой элемент.
	КонецЕсли;
	#КонецЕсли
КонецПроцедуры		// ВыполнитьПредыдущийОбработчикПриИзмененииОрганизации()

&НаСервере
Процедура ОпределитьСостояниеОбъекта(ОбновитьОтветственныхВход = Ложь)
	
	ДействияСогласованиеУХСервер.ОпределитьСостояниеЗаявки(ЭтаФорма, ОбновитьОтветственныхВход);
    УстановитьВидимостьДоступностьЭлементов();
	
КонецПроцедуры	

&НаКлиенте
Процедура ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение)
	ДействияСогласованиеУХКлиент.ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЗаявкиОбработкаВыбораПродолжение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Записать();
		ИзменитьСостояниеЗаявкиКлиент(Параметры.ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИзменитьСостояниеЗаявки(Ссылка, Состояние)
	
	Возврат УправлениеПроцессамиСогласованияУХ.ПеревестиЗаявкуВПроизвольноеСостояние(Ссылка, Состояние, , , ЭтаФорма);
		
КонецФункции

&НаКлиенте
Процедура СтатусОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение = РеквизитСостояниеЗаявки(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() ИЛИ ЭтаФорма.Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СостояниеЗаявкиОбработкаВыбораПродолжение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение));
		ТекстВопроса = НСтр("ru = 'Данные еще не записаны.
				|Изменение состояния возможно только после записи данных.
				|Данные будут записаны.'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
	КонецЕсли;
	ИзменитьСостояниеЗаявкиКлиент(ВыбранноеЗначение);	

КонецПроцедуры

&НаКлиенте
Процедура ОсновнаяОрганизацияПриИзменении(Элемент)
	#Если ВебКлиент Тогда
	ОпределитьСостояниеОбъекта(Истина);	
	#КонецЕсли
КонецПроцедуры

#КонецОбласти

 #Область РаботаСоСпискомПроектов
 
 &НаКлиенте
Процедура ЗаполнитьПроекты(Команда)
	
	Если Проекты.Количество()>0 Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросОНеобходимостиЗаполнитьПроектыЗавершение",ЭтаФорма);
		ПоказатьВопрос(Оповещение, Нстр("ru = 'Текущий список проектов будет заполнен заново, продолжить?'"), РежимДиалогаВопрос.ДаНет);		
	Иначе
		ЗаполнитьСписокПроектов();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУтвержденныеПроекты(Команда)

	Если Проекты.Количество()>0 Тогда
		Оповещение = Новый ОписаниеОповещения("ВопросОНеобходимостиЗаполнитьУтвПроектыЗавершение",ЭтаФорма);
		ПоказатьВопрос(Оповещение, Нстр("ru = 'Текущий список проектов будет заполнен заново, продолжить?'"), РежимДиалогаВопрос.ДаНет);		
	Иначе
		ЗаполнитьСписокПроектов(Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросОНеобходимостиЗаполнитьПроектыЗавершение(Результат, ДополнительныеПараметры) Экспорт      
	
	Если Результат = Неопределено  Или Результат = КодВозвратаДиалога.Нет  Тогда
		Возврат;
	КонецЕсли;	
	
    ЗаполнитьСписокПроектов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОНеобходимостиЗаполнитьУтвПроектыЗавершение(Результат, ДополнительныеПараметры) Экспорт      
	
	Если Результат = Неопределено  Или Результат = КодВозвратаДиалога.Нет  Тогда
		Возврат;
	КонецЕсли;	
	
    ЗаполнитьСписокПроектов(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПроектов(ТолькоУтвержденные = Ложь)
	
	
	  Запрос = Новый Запрос;
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	Проекты.Ссылка КАК Проект,
	                 |	Проекты.РазделИнвестиционнойПрограммы КАК РазделИнвестиционнойПрограммы,
	                 |	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК Статус,
	                 |	АтрибутыПроектов.ИтогоСписанияБДДС КАК ИтогоСписанияБДДС,
	                 |	АтрибутыПроектов.ИтогоРасходыБДР КАК ИтогоРасходыБДР,
	                 |	АтрибутыПроектов.ИтогоПоступленияБДДС КАК ИтогоПоступленияБДДС,
	                 |	АтрибутыПроектов.ИтогоДоходыБДР КАК ИтогоДоходыБДР,
	                 |	АтрибутыПроектов.ИтогоЧистыйДенежныйПоток КАК ИтогоЧистыйДенежныйПоток,
	                 |	АтрибутыПроектов.ИтогоПрибыльУбыток КАК ИтогоПрибыльУбыток,
	                 |	АтрибутыПроектов.ДлительностьДней КАК ДлительностьДней
	                 |ИЗ
	                 |	Справочник.Проекты КАК Проекты
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АтрибутыПроектов КАК АтрибутыПроектов
	                 |		ПО Проекты.Ссылка = АтрибутыПроектов.Проект
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
	                 |		ПО Проекты.Ссылка = РегистрСостоянийОбъектовСрезПоследних.Объект
	                 |ГДЕ
	                 |	Проекты.Организация = &Организация
	                 |	И АтрибутыПроектов.Сценарий = &Сценарий
	                 |	И АтрибутыПроектов.ДатаОкончания >= &ДатаНачалаПрограммы
	                 |	И АтрибутыПроектов.ДатаНачала <= &ДатаОкончанияПрограммы
	                 |	И Проекты.Проект = ИСТИНА
	                 |	И Проекты.ПометкаУдаления = ЛОЖЬ";
	  
	  Запрос.УстановитьПараметр("Организация",Объект.Организация);
	  Запрос.УстановитьПараметр("Сценарий",Объект.Сценарий);
      Запрос.УстановитьПараметр("ДатаНачалаПрограммы",Объект.Период.ДатаНачала);
	  Запрос.УстановитьПараметр("ДатаОкончанияПрограммы",Объект.ПериодОкончание.ДатаНачала);

	  
	  РезультатПроекты = Запрос.Выполнить().Выгрузить();
	  
	  Проекты.Очистить();
	  
	  Если ТолькоУтвержденные Тогда
		  
		  РезультатПроекты =  РезультатПроекты.Скопировать(Новый Структура("Статус",Перечисления.СостоянияПроектов.Утвержден));
		  
	  КонецЕсли;	  
	  
	  Для Каждого текПроект Из РезультатПроекты Цикл
		  
		  нСтрокаПроект = Проекты.Добавить();
		  ЗаполнитьЗначенияСвойств(нСтрокаПроект,текПроект);
		  
	  КонецЦикла;	  
	  
	  ОбновитьЗначенияАтрибутовПроектов();

	  ЭтаФорма.Модифицированность = Истина;
		
КонецПроцедуры	

&НаСервере
Процедура ОбновитьЗначенияАтрибутовПроектов()
	
	СписокПроектов 		=  Проекты.Выгрузить().ВыгрузитьКолонку("Проект");
	АтрибутыПроектов    =  ВернутьКлючевыеПоказателиПроектов(СписокПроектов);
	
	Для Каждого Проект Из Проекты Цикл
		
		тСтрокаАтрибут = АтрибутыПроектов.Найти(Проект.Проект,"Проект");
		Если Не тСтрокаАтрибут = Неопределено Тогда
			
			  ЗаполнитьЗначенияСвойств(Проект,тСтрокаАтрибут);
	
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаСервере
Функция ВернутьКлючевыеПоказателиПроектов(СписокПроектов)

  	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Проекты.Ссылка КАК Проект,
	               |	Проекты.РазделИнвестиционнойПрограммы КАК РазделИнвестиционнойПрограммы,
	               |	РегистрСостоянийОбъектовСрезПоследних.СостояниеОбъекта КАК Статус,
	               |	АтрибутыПроектов.ИтогоСписанияБДДС КАК ИтогоСписанияБДДС,
	               |	АтрибутыПроектов.ИтогоРасходыБДР КАК ИтогоРасходыБДР,
	               |	АтрибутыПроектов.ИтогоПоступленияБДДС КАК ИтогоПоступленияБДДС,
	               |	АтрибутыПроектов.ИтогоДоходыБДР КАК ИтогоДоходыБДР,
	               |	АтрибутыПроектов.ИтогоЧистыйДенежныйПоток КАК ИтогоЧистыйДенежныйПоток,
	               |	АтрибутыПроектов.ИтогоПрибыльУбыток КАК ИтогоПрибыльУбыток,
	               |	АтрибутыПроектов.ДлительностьДней КАК ДлительностьДней,
	               |	СостояниеОценкиОбъектов.Завершен КАК ОценкаЗавершена,
	               |	АтрибутыПроектов.ДатаНачала КАК ДатаНачала,
	               |	0 КАК ИтоговыйБалл,
	               |	АтрибутыПроектов.ДатаОкончания КАК ДатаОкончания,
	               |	СостояниеОценкиОбъектов.ЭтапОценки КАК ЭтапОценки,
	               |	Проекты.НеОцениваетсяПоКритериям КАК НеОцениваетсяПоКритериям
	               |ИЗ
	               |	Справочник.Проекты КАК Проекты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АтрибутыПроектов КАК АтрибутыПроектов
	               |		ПО Проекты.Ссылка = АтрибутыПроектов.Проект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегистрСостоянийОбъектов.СрезПоследних КАК РегистрСостоянийОбъектовСрезПоследних
	               |		ПО Проекты.Ссылка = РегистрСостоянийОбъектовСрезПоследних.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеОценкиОбъектов КАК СостояниеОценкиОбъектов
	               |		ПО Проекты.Ссылка = СостояниеОценкиОбъектов.ОбъектОценки
	               |ГДЕ
	               |	АтрибутыПроектов.Сценарий = &Сценарий
	               |	И Проекты.Ссылка В(&Проекты)";
	
	Запрос.УстановитьПараметр("Проекты",СписокПроектов);
	Запрос.УстановитьПараметр("Сценарий",Объект.Сценарий);
	Запрос.УстановитьПараметр("ИнвестиционнаяПрограмма",Объект.Ссылка);
	
	ТзАтрибуты =  Запрос.Выполнить().Выгрузить();
	Для Каждого АСтр Из ТзАтрибуты Цикл
		
		Если АСтр.НеОцениваетсяПоКритериям Тогда
			АСтр.ИтоговыйБалл = 1;
			АСтр.ОценкаЗавершена = Истина;
		Иначе	
			
			АСтр.ИтоговыйБалл =  ВыборОбъектовУХ.ИнтегральнаяОценкаОбъекта(АСтр.РазделИнвестиционнойПрограммы
			, АСтр.Проект
			, АСтр.ЭтапОценки
			, Ложь);
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат ТзАтрибуты;
	
КонецФункции	

&НаСервере
Процедура ПрочитатьТЧПроекты(ОбновлятьЗначенияАтрибутов = Ложь)
	
	//прочитаем таблицу текущих проектов в табличную часть
	Для Каждого СтрПроект Из Объект.Проекты Цикл		
		нСтрокаПроект = Проекты.Добавить();
		ЗаполнитьЗначенияСвойств(нСтрокаПроект,СтрПроект);				
	КонецЦикла;	 
	
	//Обновим все значения по текущим данным
	Если ОбновлятьЗначенияАтрибутов Тогда
		ОбновитьЗначенияАтрибутовПроектов();
	КонецЕсли;
			
КонецПроцедуры	

&НаКлиенте
Процедура ВвестиЗначенияКритериев(Команда)
	
	Если Элементы.Проекты.ТекущиеДанные = Неопределено Тогда		
		Возврат;
	КонецЕсли;
		
	ТекущийПроект 		= Элементы.Проекты.ТекущиеДанные.Проект;
	ТекущийРаздел 		= Элементы.Проекты.ТекущиеДанные.РазделИнвестиционнойПрограммы;
	ТекущаяПрограмма 	= Объект.Ссылка;
	
	ОповещениеОценкаПоКритериямЗавршение = Новый ОписаниеОповещения("ОценкаПоКритериямЗавршение", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура("РазделИнвестиционнойПрограммы,Проект,ИнвестиционнаяПрограмма",ТекущийРаздел,ТекущийПроект,ТекущаяПрограмма);  
	ОткрытьФорму("Обработка.ОценкаОбъектовИнвестиционныхПроектов.Форма", ПараметрыФормы, ЭтаФорма, Ложь,,,ОповещениеОценкаПоКритериямЗавршение);

КонецПроцедуры

&НаКлиенте
Процедура ОценкаПоКритериямЗавршение(Результат, ДополнительныеПараметры) Экспорт
	
	 ОбновитьДанныеПроектов(Неопределено);
	 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПроектов(Команда)
	
	ОбновитьЗначенияАтрибутовПроектов();

КонецПроцедуры

&НаКлиенте
Процедура ПроектыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ПроектыИтоговыйБалл" ИЛИ Поле.Имя = "ПроектыОценкаЗавершена" Тогда		
		ВвестиЗначенияКритериев(Неопределено);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПроектыПриИзменении(Элемент)
	
	ОбновитьЗначенияАтрибутовПроектов();
	ЭтаФорма.Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаОтображенияПриИзменении(Элемент)

       ОбновитьОтображениеПоказателей();

КонецПроцедуры

&НаСервере
Процедура  ОбновитьОтображениеПоказателей();
	
	Элементы.Поступление.Заголовок 	= Нстр("ru = 'Поступления '")+ПолучитьПредставлениеМасштаба(Объект.ЕдиницаОтображения)+ " "+ВалютаПоказателей;
    Элементы.Списание.Заголовок 	= Нстр("ru = 'Списания '")+ПолучитьПредставлениеМасштаба(Объект.ЕдиницаОтображения)+" "+ВалютаПоказателей;
		
	ФорматМасштаба =   ПолучитьФорматМасштаба(Объект.ЕдиницаОтображения);
	
	Если Объект.ЕдиницаОтображения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда
		Элементы.ПроектыИтогоДоходыБДР.Формат 			=   ФорматМасштаба;
		Элементы.ПроектыИтогоПоступленияБДДС.Формат 	=   ФорматМасштаба;
		Элементы.ПроектыИтогоРасходыБДР.Формат 			=   ФорматМасштаба;
		Элементы.ПроектыИтогоСписанияБДДС.Формат 		=   ФорматМасштаба;		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеМасштаба(ЕдиницаИзмерения)
	
	Если ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда
		ТекущийДелитель = Нстр("ru = 'Млн.'");
	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда
		ТекущийДелитель  = Нстр("ru = 'Тыс.'");
	Иначе
		ТекущийДелитель =  "";
	КонецЕсли;
	
	Возврат ТекущийДелитель;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьФорматМасштаба(ЕдиницаИзмерения)
	
	Если ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда
		ФорматМасштаба = "ЧДЦ=2; ЧС=6";
	ИначеЕсли ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда
		ФорматМасштаба  = "ЧДЦ=2; ЧС=3";
	Иначе
		ФорматМасштаба =  "ЧДЦ=2; ЧС=0";
	КонецЕсли;
	
	Возврат ФорматМасштаба;
	
КонецФункции




&НаСервере
Процедура ПолучитьСводныйОтчет()
	
	РазделыСводнаяИнформация.Очистить();

	МакетИтоговыйОтчет = Справочники.ИнвестиционныеПрограммы.ПолучитьМакет("МакетИтоговогоОтчетаИПР");
	
	//Установить формат числовых ячеек
	ФорматМасштаба =   ПолучитьФорматМасштаба(Объект.ЕдиницаОтображения);
	Для ИндСтроки = МакетИтоговыйОтчет.ФиксацияСверху по МакетИтоговыйОтчет.ВысотаТаблицы Цикл
		Для ИндКолонки = МакетИтоговыйОтчет.ФиксацияСлева по МакетИтоговыйОтчет.ШиринаТаблицы Цикл			
			МакетИтоговыйОтчет.Область(ИндСтроки,ИндКолонки,ИндСтроки,ИндКолонки).Формат = ФорматМасштаба;
		КонецЦикла;			
	КонецЦикла;	
	
	ОбластьШапка       = МакетИтоговыйОтчет.ПолучитьОбласть("ОбластьШапкаТаблицы");
    ОбластьШапка.Параметры.Заголовок1 	= Нстр("ru = 'Поступления '")+ПолучитьПредставлениеМасштаба(Объект.ЕдиницаОтображения)+ " "+ВалютаПоказателей;
    ОбластьШапка.Параметры.Заголовок2 	= Нстр("ru = 'Списания '")+ПолучитьПредставлениеМасштаба(Объект.ЕдиницаОтображения)+" "+ВалютаПоказателей;
		
	РазделыСводнаяИнформация.Вывести(ОбластьШапка);
	
	ОбластьИтого       = МакетИтоговыйОтчет.ПолучитьОбласть("ОластьРазделИтого");
    ОбластьИтого.Параметры.БДРПоступления 		= Проекты.Итог("ИтогоДоходыБДР");
	ОбластьИтого.Параметры.БДДСПоступления 		= Проекты.Итог("ИтогоПоступленияБДДС");
    ОбластьИтого.Параметры.БДРСписания 			= Проекты.Итог("ИтогоРасходыБДР");
	ОбластьИтого.Параметры.БДДССписания 		= Проекты.Итог("ИтогоСписанияБДДС");
	
		
	РазделыСводнаяИнформация.Вывести(ОбластьИтого);
	
	ТекущиеРазделы = Проекты.Выгрузить().Скопировать();
	ТекущиеРазделы.Свернуть("РазделИнвестиционнойПрограммы");
	
	РазделыСводнаяИнформация.НачатьГруппуСтрок();
	
	ОбластьРаздел   =  МакетИтоговыйОтчет.ПолучитьОбласть("ОластьРазделПрограммы");
    ОбластьПроект   =  МакетИтоговыйОтчет.ПолучитьОбласть("ОластьПроект");

	
	Для Каждого СтрРаздел Из ТекущиеРазделы Цикл
		
		тПроектыРаздела =  Проекты.Выгрузить(Новый Структура("РазделИнвестиционнойПрограммы",СтрРаздел.РазделИнвестиционнойПрограммы)).Скопировать();
		
		ОбластьРаздел.Параметры.Раздел =  СтрРаздел.РазделИнвестиционнойПрограммы;
	
		ОбластьРаздел.Параметры.БДРПоступления 		= тПроектыРаздела.Итог("ИтогоДоходыБДР");
		ОбластьРаздел.Параметры.БДДСПоступления 	= тПроектыРаздела.Итог("ИтогоПоступленияБДДС");
		ОбластьРаздел.Параметры.БДРСписания 		= тПроектыРаздела.Итог("ИтогоРасходыБДР");
		ОбластьРаздел.Параметры.БДДССписания 		= тПроектыРаздела.Итог("ИтогоСписанияБДДС");
		
		РазделыСводнаяИнформация.Вывести(ОбластьРаздел);
		
		РазделыСводнаяИнформация.НачатьГруппуСтрок();

		Для Каждого тПроект Из тПроектыРаздела Цикл
			
			
			ОбластьПроект.Параметры.Проект =  тПроект.Проект;
			
			ОбластьПроект.Параметры.БДРПоступления 		= тПроект.ИтогоДоходыБДР;
			ОбластьПроект.Параметры.БДДСПоступления 	= тПроект.ИтогоПоступленияБДДС;
			ОбластьПроект.Параметры.БДРСписания 		= тПроект.ИтогоРасходыБДР;
			ОбластьПроект.Параметры.БДДССписания 		= тПроект.ИтогоСписанияБДДС;
			
			РазделыСводнаяИнформация.Вывести(ОбластьПроект);
			
			
		КонецЦикла;	
		
		РазделыСводнаяИнформация.ЗакончитьГруппуСтрок();

		
	КонецЦикла;	
	
	РазделыСводнаяИнформация.ЗакончитьГруппуСтрок();
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаРазделы Тогда
		 ПолучитьСводныйОтчет();
	КонецЕсли;	
	
КонецПроцедуры


 #КонецОбласти
